Consider following code to answer further questions:
```
import pandas as pd
course_name = ['Data Science’, 'Machine Learning’, 'Big Data’, 'Data Engineer’]
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name’ : course_name, 'duration’ : duration})
```

#### Q1. Write a code to print the data present in the second row of the dataframe, df.

In [27]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [30]:
# second row of the dataframe

print(df.iloc[[2]])

df.iloc[2,:] # another way

  course_name  duration
2    Big Data         6

course_name    Big Data
duration              6
Name: 2, dtype: object

#### Q2. What is the difference between the functions `loc` and `iloc` in pandas.DataFrame?

`loc` helps in fetchign the records from the dataframe based on the label name (of row and column)

`iloc` helps in fetching the records from the dataframe based on the index

Some exmaple code is given below:

In [40]:
test = pd.DataFrame([[1, 2], [4, 5], [7, 8], [11, 22], [33, 44]],
index=['r1', 'r2', 'r3', 'r4', 'r5'],
columns=['num1', 'num2'])

test

    num1  num2
r1     1     2
r2     4     5
r3     7     8
r4    11    22
r5    33    44

In [41]:
test.loc[['r1', 'r2']]

    num1  num2
r1     1     2
r2     4     5

In [42]:
test.loc['r1', 'num2']  # row label-'r1', along woth column label-'num2'

2

In [49]:
test.loc['r2':'r5', 'num2']

r2     5
r3     8
r4    22
r5    44
Name: num2, dtype: int64

In [44]:
test.iloc[[3]]  # getting a particual row based on its index number

    num1  num2
r4    11    22

In [46]:
test.iloc[[0,4],[1]] # fetchng 2 rows and 1 column

    num2
r1     2
r5    44

In [47]:
# slicing 3 rows and all columns

test.iloc[:3,:]

    num1  num2
r1     1     2
r2     4     5
r3     7     8

In [48]:
# slicing from 3rd row to last row and all columns

test.iloc[2:,:]

    num1  num2
r3     7     8
r4    11    22
r5    33    44

#### Q3. Reindex the given dataframe using a variable, `reindex = [3,0,1,2]` and store it in the variable, `new_df` then find the output for both `new_df.loc[2]` and `new_df.iloc[2]`.

#### Did you observe any difference in both the outputs? If so then explain it.

In [56]:
df.head()

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [53]:
new_df = df.reindex(index = [3,0,1,2])
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [54]:
new_df.loc[[2]]

  course_name  duration
2    Big Data         6

In [55]:
new_df.iloc[[2]]

        course_name  duration
1  Machine Learning         3

when the code `new_df.loc[[2]]` is run, python will search for the record that has the row named with the label `"2"` and fetch that record.

On the other had when the code `new_df.iloc[[2]]` is run, python search the record which is at **index** number `2` and fetch that record. *the indexing is 0 based*